#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['мама', 'папа', 'я']

# список списков приблизительного роста членов вашей семьи
my_family_height = [
    ['мама', 165],
    ['папа', 180],
    ['я', 175],
]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см

# TODO здесь ваш код

def run():
    print(f'Рост отца - {my_family_height[1][1]} см')

    total_height = sum(member[1] for member in my_family_height)
    print(f'Общий рост моей семьи - {total_height} см')


if __name__ == '__main__':
    run()
